# Домашнее задание №1 Задача №1
# Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

# Пример работы с переменными
admin_name = 'Денис'
admin_age = 32
admin_height = 184.5
print(f'Привет! меня зовут {admin_name}, мне {admin_age} года, мой рост {admin_height} см')

# Пример запроса у пользователя данных
user_name = input('Введите свое имя ')
city_from = input('Из какого вы города? ')
distance = input('Сколько километров вы пробегаете в день? ')
print(f'Вы {user_name} из {city_from} и пробегаете в день {distance} км')


